const { SlashCommandBuilder } = require("@discordjs/builders");
const builders = require("@discordjs/builders");

module.exports = {
    data: new SlashCommandBuilder()
    .setName("about")
    .setDescription("Дізнайтеся більше про бота. Більшість з цієї інформації це тупо щоби бустить моє его."),
    category: "інформація",
    async execute(message,args,Discord,client,player,config) {
        if(message.channel.id !== config.botChannel) return await client.replyOrSend({content: "Цю команду можна використовувати тільки у бот-чаті!", ephemeral: true}, message);

        // special space character - "⠀"
        let about = new Discord.MessageEmbed()
        .setColor("#40e224")
        .setTitle("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀Про PeaceDuke:")
        .setDescription("⠀⠀⠀⠀**PeaceDuke** - мультифункціональний Discord бот\n" + 
        "⠀⠀⠀у собі має фічи DJ бота, модерації, мініігор, та інші.\n" + 
        "⠀Якщо маєте ідею як покращити бота, зверніться до раді.\nВикористайте /help, щоби дізнатися про можливості бота.\n\n" + 
        "⠀⠀⠀⠀⠀⠀⠀Поточна версія - **Update 1.3.6:**\n⠀_Головні нові зміни: повна підтримка префікс інтерфейсу._"+
        "\n\n\n⠀⠀⠀⠀⠀⠀Включений з :⠀⠀" + builders.time(client.readyAt) +
        "\n⠀⠀⠀⠀⠀⠀Розроблюється з: " + builders.time((new Date(2022, 0, 1, 22, 30))) + 
        "\n\n"+//⠀⠀⠀⠀⠀⠀PeaceDuke розроблюється redhauser#8140\n"+
        "\n⠀⠀⠀⠀⠀⠀**⊙** " + builders.hyperlink("GitHub", "https://github.com/redhauser") + " **⊙** **redhauser#8140** **⊙** " + builders.hyperlink("osu!", "https://osu.ppy.sh/users/26200992") + " **⊙**");

        await client.replyOrSend({embeds: [about]}, message);

    }
}
/*"**PeaceDuke - Discord бот створений redhauser#8140.\nВін має розвинуті фічи музикального бота, "
        + "мініігри, команди для модерації, LVL систему, та інші.**\n\nPeaceDuke завжди розвивається - і якщо ви маєте ідеї як можна покращити бота, зверніться до раді!\n\n"
        + "**Patch 1.3.1** - команда `loop`, `delete` тепер мають повну підтримку префікс інтерфейсу.\nПофіксив пару багів, зробив пару граматичних та естетичних змін.\nКоманда `stats` тепер повинна показувати більш точну інформацію про кількість повідомлень користувача.\n`plist` команда буде відсутня до наступнього великого апдейта.\n"
        + "**Update 1.3** - повна* підтримка префікс інтерфейсу, пару змін для краси, та LVL система.\n"
        ); */
/*
Update 1.2
    .setDescription("**PeaceDuke - офіційний бот серверу Correction Fluid, розроблений редхуюзером.\nУ собі він поміщає фічи музикального бота, "
        + "ігри, різні розваги та команди для модерації, а також старається бути активним учасником серверу.**\n\nPeaceDuke завжди розвивається - і якщо ви хочете покращити його, зверніться до редхавзера.\n\n"
        + "**Якщо ви хочете дізнатися про існуючі команди та їх використання, використайте `/help`.**\n\n\n"
        + "Інформація про Patch 1.2:\nБуло добавлено `/playlist`,`/shuffle`,`/delete`,`/remove`\nДороблені та частково перероблені команди як `/loop`,`/queue`,`/skip`, та ще пару інших.\n/play та /plnow тепер може грати ютуб плейлисти!"
        + "\n\n\n**Насолоджуйтесь сервером Correction Fluid!**");
        
*/
/*
    Update 1.1.1
            .setColor("#40e224")
        .setTitle("Про бота:")
        .setDescription("**PeaceDuke - офіційний бот серверу Correction Fluid, розроблений редхуюзером.\nУ собі він поміщає фічи музикального бота, "
        + "ігри, різні розваги та команди для модерації, а також старається бути активним учасником серверу.**\n\nPeaceDuke завжди розвивається - і якщо ви хочете покращити його, зверніться до редхавзера.\n\n"
        + "**Якщо ви хочете дізнатися про існуючі команди та їх використання, використайте `/help`.**\n\n\n"
        + "Інформація про Patch 1.1.1!\n"
        + " - Бот має більше злих відповідей і більше рандомних фразочок. Також, період рандомних фразочок був змінений.\n"
        + " - `/con4` - тепер має нічию (bruh), гра сама з собою тепер без багів, і взагалом пофіксив пару багів пов'язаний з цією командою.\n"
        + " - `/skip` - пофіксив баг.\n"
        + " - `/stats` - тепер повинен показувати більш точну цифру кількості повідомлень користувача? Як мінімум, повинен.\n"
        + " - А також пару маленьких оновлень які абсолютно не важливі майже всім.\n"
        + "\n\n\n**Насолоджуйтесь сервером Correction Fluid!**");
        await message.reply({embeds: [about]});
*/
/* Update 1.1 
        let about = new Discord.MessageEmbed()
        .setColor("#40e224")
        .setTitle("Про бота:")
        .setDescription("**PeaceDuke - офіційний бот серверу Correction Fluid, розроблений редхуюзером.\nУ собі він поміщає фічи музикального бота, "
        + "ігри, різні розваги та команди для модерації, а також старається бути активним учасником серверу.**\n\nPeaceDuke завжди розвивається - і якщо ви хочете покращити його, зверніться до редхавзера.\n\n"
        + "**Якщо ви хочете дізнатися про існуючі команди та їх використання, використайте `/help`**\n\n\n"
        + "Інформація про *15.03.2022* апдейт!\n -- Всі музикальні фічи були оптимізовані і допилені, тому взагалом ви повинні помітити кращий експіріенс при їх використанні.\n"
        + " -- `/con4` - нова мінігра, \"Чотири в ряд!\"\n"
        + " -- `/queue` отримала кучу нового функціоналу! Тепер за допомогою цієї команди можна і водночас контролювати плеєром.\n"
        + " -- `/about` - нова команда, яку ви прям зараз використовуєте. Можливо вона допоможе зацікавити когось до бота.\n"
        + " -- Бот тепер час від часу каже різні фразочки.\n"
        + " -- /loop отримав новий функціонал - тепер можна ставити повтор всієї черги, а не тільки поточної пісні!"
        + "\n\n\n**Насолоджуйтесь сервером Correction Fluid!**");
*/