const { SlashCommandBuilder } = require("@discordjs/builders");

module.exports = {
    data: new SlashCommandBuilder()
    .setName("about")
    .setDescription("Дізнайтеся більше про цього бота! Як ним користуватися, новини, та майбутнє."),
    async execute(message,args,Discord,client,player,config) {
        if(message.channel.id !== config.botChannel) return await message.reply({content: "Цю команду можна використовувати тільки у бот-чаті!", ephemeral: true});

        let about = new Discord.MessageEmbed()
        .setColor("#40e224")
        .setTitle("Про бота:")
        .setDescription("**PeaceDuke - офіційний бот серверу Correction Fluid, розроблений редхуюзером.\nУ собі він поміщає фічи музикального бота, "
        + "ігри, різні розваги та команди для модерації, а також старається бути активним учасником серверу.**\n\nPeaceDuke завжди розвивається - і якщо ви хочете покращити його, зверніться до редхавзера.\n\n"
        + "**Якщо ви хочете дізнатися про існуючі команди та їх використання, використайте `/help`**\n\n\n"
        + "Інформація про *15.03.2022* апдейт!\n -- Всі музикальні фічи були оптимізовані і допилені, тому взагалом ви повинні помітити кращий експіріенс при їх використанні.\n"
        + " -- `/con4` - нова мінігра, \"Чотири в ряд!\"\n"
        + " -- `/queue` отримала кучу нового функціоналу! Тепер за допомогою цієї команди можна і водночас контролювати плеєром.\n"
        + " -- `/about` - нова команда, яку ви прям зараз використовуєте. Можливо вона допоможе зацікавити когось до бота.\n"
        + " -- Бот тепер час від часу каже різні фразочки.\n"
        + " -- /loop отримав новий функціонал - тепер можна ставити повтор всієї черги, а не тільки поточної пісні!"
        + "\n\n\n**Насолоджуйтесь сервером Correction Fluid!**");
        await message.reply({embeds: [about]});
    }
}