const { SlashCommandBuilder } = require("@discordjs/builders");

module.exports = {
    data: new SlashCommandBuilder()
    .setName("about")
    .setDescription("Дізнайтеся більше про цього бота! Як ним користуватися, patch notes, та інші нецікаві речі."),
    category: "інформація",
    async execute(message,args,Discord,client,player,config) {
        if(message.channel.id !== config.botChannel) return await client.replyOrSend({content: "Цю команду можна використовувати тільки у бот-чаті!", ephemeral: true}, message);


        let about = new Discord.MessageEmbed()
        .setColor("#40e224")
        .setTitle("Про бота:")
        .setDescription("**PeaceDuke - " + ("офіційний бот серверу Correction Fluid, розроблений редхуюзером.") + "\nУ собі він поміщає фічи музикального бота, "
        + "ігри, різні розваги, команди для модерації, та різні секретики.**\n\nPeaceDuke завжди розвивається - і якщо ви хочете покращити його, зверніться до раді.\n\n"
        + "Update 1.3 - повна* підтримка префікс інтерфейсу, пару змін для красоти, та LVL система."
        + "\n\n\n**Насолоджуйтесь сервером Correction Fluid!**");

        await client.replyOrSend({embeds: [about]}, message);

    }
}
/*
Update 1.2
    .setDescription("**PeaceDuke - офіційний бот серверу Correction Fluid, розроблений редхуюзером.\nУ собі він поміщає фічи музикального бота, "
        + "ігри, різні розваги та команди для модерації, а також старається бути активним учасником серверу.**\n\nPeaceDuke завжди розвивається - і якщо ви хочете покращити його, зверніться до редхавзера.\n\n"
        + "**Якщо ви хочете дізнатися про існуючі команди та їх використання, використайте `/help`.**\n\n\n"
        + "Інформація про Patch 1.2:\nБуло добавлено `/playlist`,`/shuffle`,`/delete`,`/remove`\nДороблені та частково перероблені команди як `/loop`,`/queue`,`/skip`, та ще пару інших.\n/play та /plnow тепер може грати ютуб плейлисти!"
        + "\n\n\n**Насолоджуйтесь сервером Correction Fluid!**");
        
*/
/*
    Update 1.1.1
            .setColor("#40e224")
        .setTitle("Про бота:")
        .setDescription("**PeaceDuke - офіційний бот серверу Correction Fluid, розроблений редхуюзером.\nУ собі він поміщає фічи музикального бота, "
        + "ігри, різні розваги та команди для модерації, а також старається бути активним учасником серверу.**\n\nPeaceDuke завжди розвивається - і якщо ви хочете покращити його, зверніться до редхавзера.\n\n"
        + "**Якщо ви хочете дізнатися про існуючі команди та їх використання, використайте `/help`.**\n\n\n"
        + "Інформація про Patch 1.1.1!\n"
        + " - Бот має більше злих відповідей і більше рандомних фразочок. Також, період рандомних фразочок був змінений.\n"
        + " - `/con4` - тепер має нічию (bruh), гра сама з собою тепер без багів, і взагалом пофіксив пару багів пов'язаний з цією командою.\n"
        + " - `/skip` - пофіксив баг.\n"
        + " - `/stats` - тепер повинен показувати більш точну цифру кількості повідомлень користувача? Як мінімум, повинен.\n"
        + " - А також пару маленьких оновлень які абсолютно не важливі майже всім.\n"
        + "\n\n\n**Насолоджуйтесь сервером Correction Fluid!**");
        await message.reply({embeds: [about]});
*/
/* Update 1.1 
        let about = new Discord.MessageEmbed()
        .setColor("#40e224")
        .setTitle("Про бота:")
        .setDescription("**PeaceDuke - офіційний бот серверу Correction Fluid, розроблений редхуюзером.\nУ собі він поміщає фічи музикального бота, "
        + "ігри, різні розваги та команди для модерації, а також старається бути активним учасником серверу.**\n\nPeaceDuke завжди розвивається - і якщо ви хочете покращити його, зверніться до редхавзера.\n\n"
        + "**Якщо ви хочете дізнатися про існуючі команди та їх використання, використайте `/help`**\n\n\n"
        + "Інформація про *15.03.2022* апдейт!\n -- Всі музикальні фічи були оптимізовані і допилені, тому взагалом ви повинні помітити кращий експіріенс при їх використанні.\n"
        + " -- `/con4` - нова мінігра, \"Чотири в ряд!\"\n"
        + " -- `/queue` отримала кучу нового функціоналу! Тепер за допомогою цієї команди можна і водночас контролювати плеєром.\n"
        + " -- `/about` - нова команда, яку ви прям зараз використовуєте. Можливо вона допоможе зацікавити когось до бота.\n"
        + " -- Бот тепер час від часу каже різні фразочки.\n"
        + " -- /loop отримав новий функціонал - тепер можна ставити повтор всієї черги, а не тільки поточної пісні!"
        + "\n\n\n**Насолоджуйтесь сервером Correction Fluid!**");
*/